TEST_CASE/SW/All/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            patch;
        nFaces          3504;
        startFace       1510557;
    }
    overset2
    {
        type            overset;
        inGroups        1(overset);
        nFaces          13764;
        startFace       1514061;
    }
    hole
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2520;
        startFace       1527825;
    }
)

// ************************************************************************* //
