TEST_CASE/SW/All/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



simulationType  LES; //RAS;

LES
{
    turbulence      on;
    LESModel        dynamicKEqn;
    delta           cubeRootVol;


dynamicKEqnCoeffs
{
filter simple;
}

cubeRootVolCoeffs
{
    // Optional entries

    // Multiplier
    deltaCoeff      1;
}

}

// ************************************************************************* //
