TEST_CASE/SW/All/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0); //$flowVelocity;

boundaryField
{
    overset2
    {
        type            overset;
    }

    walls
    {
         /*type            freestreamVelocity;
         freestreamValue uniform (0 0 0);*/

        /*type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;*/

	type zeroGradient;
    }

    hole
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
