TEST_CASE/SW/All/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;//$pressure;

boundaryField
{

    overset2
    {
        type            overset;
    }

    walls
    {
       /* type            freestreamPressure;
        freestreamValue $internalField;*/        		/*type            inletOutlet;
        inletValue      uniform 0;
        value           $internalField; */

	//type zeroGradient; 

	type fixedValue; 
	value uniform 0;
  }

    hole
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
