TEST_CASE/SW/All/0.orig/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   uniform (0 -0 0);

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    overset2
    {
        type            overset;
        value           uniform (0 -0 0);
    }
    hole
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
}


// ************************************************************************* //
