TEST_CASE/SW/All/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;

    libs            ("libforces.so");


    patches         (hole);
    rho             rhoInf;               // Indicates incompressible
    rhoInf          1.204;           // Redundant for incompressible
    liftDir         (0 0 1);
    dragDir         (0.70710 0.70710 0);
    CofR            (0 0 0);    
    pitchAxis       (0 0 1);
    magUInf         3.9011704;
    lRef            1;		
    Aref            0.0007689;        	


}


// ************************************************************************* //
