TEST_CASE/SW/All/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   {
        name    c0;
        type    cellSet;
        action  new;
        source  regionToCell;
        insidePoints ((0.001 0.001 0.005)); //((-4.999 0 -3.999));
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     c0;
    }

    {
        name    c1;
        type    cellSet;
        action  invert;
    }
  /*  {
        name    c2;
        type    cellSet;
        action  new;
        source  regionsToCell;
        insidePoints ((0.23 0.23 0.16)); //((0.55 0.3 0.55));
        set     c1;
    }
    {
        name    c1;
        type    cellSet;
        action  subtract;
        source  cellToCell;
        set     c2;
    }*/
    {
    name    movingZone;
    type    cellZoneSet;
    action  new;
    source setToCellZone;
    sourceInfo
    {
        set c1;           // name of cellSet
    }
    }

);

// ************************************************************************* //
